app/controllers/achievements_controller.rb

  def index
    @achievements = Achievement.all
---
SELECT "achievements".* FROM "achievements"

  def create
    @achievement = Achievement.new(achievement_params)

    if @achievement.save
---
INSERT INTO "achievements" ("name", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "novato 2"], ["description", "un logro"], ["date", "2018-03-16 00:00:00"], ["created_at", "2018-03-16 16:41:26.753313"], ["updated_at", "2018-03-16 16:41:26.753313"]]

  def update
    if @achievement.update(achievement_params)
---
UPDATE "achievements" SET "name" = ?, "description" = ?, "date" = ?, "updated_at" = ? WHERE "achievements"."id" = ?  [["name", "novato"], ["description", "otro logro"], ["date", "2018-03-16 00:00:00"], ["updated_at", "2018-03-16 16:40:22.474848"], ["id", 1]]

    def set_achievement
      @achievement = Achievement.find(params[:id])
---
SELECT  "achievements".* FROM "achievements" WHERE "achievements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]