app/controllers/diets_controller.rb

SELECT "diets".* FROM "diets"
---
  def index
    @diets = Diet.all

INSERT INTO "diets" ("name", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Keto"], ["start_date", "2018-03-16 00:00:00"], ["end_date", "2018-03-16 00:00:00"], ["created_at", "2018-03-16 16:42:42.348968"], ["updated_at", "2018-03-16 16:42:42.348968"]]
---
  def create
    @diet = Diet.new(diet_params)

    if @diet.save

UPDATE "diets" SET "name" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "diets"."id" = ?  [["name", "Keto"], ["start_date", "2018-03-16 00:00:00"], ["end_date", "2018-03-16 00:00:00"], ["updated_at", "2018-03-16 16:43:28.100101"], ["id", 240]]
---
  def update
    if @diet.update(diet_params)

SELECT  "diets".* FROM "diets" WHERE "diets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_diet
      @diet = Diet.find(params[:id])