app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page],
                           :per_page => 10)

INSERT INTO "users" ("name", "email", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdasd"], ["email", "sdada@unal.edu.co"], ["bio", "hola como estas "], ["created_at", "2018-03-16 16:41:43.144600"], ["updated_at", "2018-03-16 16:41:43.144600"]]
---
  def create
    @user = User.new(user_params)

    if @user.save